<template>
  <div class="container">
    <div class="row">
      <div v-for="card in cards" :key="card.title" class="col m6">
        <learning-card :image="card.img">
          <template #title>С чего начать обучение</template>
          <template #text>
            По сути, изучение иностранного языка ничем не отличается от любой
            другой учебной дейтельности. Подходить к этому процессу следует уже
            будучи подготовленным, т.е просто взять в руки учебник, тетрадь и
            ручку - ещё недостаточно. Такой подход можно смело назвать
            дилетантским - к серьёзным успехам и желаемым результатам он никогда
            никого не приводил. В большинстве случаев дело заканчивалось лишь
            зубрёжкой и хронической усталостью. В общем, к эффективному обучению
            нужно готовиться. Подробнее о том как это делать вы можете узнать
            записавшись на наш первый бесплатный урок.</template
          >
        </learning-card>
      </div>
    </div>
  </div>
</template>

<script>
import learningCard from "./learningCard.vue";
export default {
  components: {
    learningCard,
  },
  data() {
    return {
      cards: [
        {
          title: "С чего начать обучение",
          text: "По сути, изучение иностранного языка ничем не отличается от любой другой учебной дейтельности. Подходить к этому процессу следует уже будучи подготовленным, т.е просто взять в руки учебник, тетрадь и ручку - ещё недостаточно. Такой подход можно смело назвать дилетантским - к серьёзным успехам и желаемым результатам он никогда никого не приводил. В большинстве случаев дело заканчивалось лишь зубрёжкой и хронической усталостью. В общем, к эффективному обучению нужно готовиться. Подробнее о том как это делать вы можете узнать записавшись на наш первый бесплатный урок.",
          img: require("../assets/card-photo-1.jpg"),
        },
        {
          title: "Лексика языка. Запоминание слов",
          text: "Основной составляющей любого языка является лексика — тот комплекс слов, которым в этом языке оперируют. Начинать обучение следует именно с лексики, т.к. она позволяет сформировать общее представление о языке, определить свои способности к его усвоению, прийти к пониманию того, с какими трудностями предстоит столкнуться. Не зная лексики, осваивать новый язык будет просто невозможно. Второй урок носит уже более практический характер — он рассчитан на переход от теории к практике. Вы узнаете о том, какие слова нужно запоминать в первую очередь, каким значением обладает даже минимальный словарный запас, познакомитесь с понятием частотных слов, их примерами в разных языках и вариантами их поиска. Затем будет предложено несколько техник запоминания: аудиолингвистический метод, обратный метод, мнемотехники и некоторые другие, а также наиболее эффективные техники повторения. ",
          img: require("../assets/card-photo-2.jpg"),
        }
      ],
      pic1: require("../assets/card-photo-1.jpg"),
      pic2: require("../assets/card-photo-2.jpg"),
      pic3: require("../assets/card-photo-3.jpg"),
      pic4: require("../assets/card-photo-4.jpg"),
      pic5: require("../assets/card-photo-5.jpg"),
    };
  },
};
</script>
