<template>
  <main-title id="lessons" class="title"
    >Уроки по изучению иностранного языка</main-title
  >
  <div class="container">
    <div class="row">
      <div
        v-for="(card, idx) in cards"
        :key="card.title"
        class="col m6 wow"
        :class="{ fadeInRight: idx % 2 === 1, fadeInLeft: idx % 2 === 0 }"
        data-wow-delay="100ms"
      >
        <learning-card :image="card.img">
          <template #title
            ><p class="title">{{ card.title }}</p></template
          >
          <template #text
            ><p class="text">{{ card.text }}</p></template
          >
        </learning-card>
      </div>
    </div>
  </div>
</template>

<script>
import learningCard from "./learningCard.vue";
import mainTitle from "./mainTitle.vue";
export default {
  components: {
    learningCard,
    mainTitle,
  },
  data() {
    return {
      cards: [
        {
          title: "С чего начать обучение",
          text: "По сути, изучение иностранного языка ничем не отличается от любой другой учебной дейтельности. Подходить к этому процессу следует уже будучи подготовленным, т.е просто взять в руки учебник, тетрадь и ручку - ещё недостаточно. Такой подход можно смело назвать дилетантским - к серьёзным успехам и желаемым результатам он никогда никого не приводил. В большинстве случаев дело заканчивалось лишь зубрёжкой и хронической усталостью. В общем, к эффективному обучению нужно готовиться. Подробнее о том как это делать вы можете узнать записавшись на наш первый бесплатный урок.",
          img: require("../assets/card-photo-1.jpg"),
        },
        {
          title: "Лексика языка. Запоминание слов",
          text: "Основной составляющей любого языка является лексика — тот комплекс слов, которым в этом языке оперируют. Начинать обучение следует именно с лексики, т.к. она позволяет сформировать общее представление о языке, определить свои способности к его усвоению, прийти к пониманию того, с какими трудностями предстоит столкнуться. Не зная лексики, осваивать новый язык будет просто невозможно. Второй урок носит уже более практический характер — он рассчитан на переход от теории к практике. Вы узнаете о том, какие слова нужно запоминать в первую очередь, каким значением обладает даже минимальный словарный запас, познакомитесь с понятием частотных слов, их примерами в разных языках и вариантами их поиска. Затем будет предложено несколько техник запоминания: аудиолингвистический метод, обратный метод, мнемотехники и некоторые другие, а также наиболее эффективные техники повторения. ",
          img: require("../assets/card-photo-22.jpg"),
        },
        {
          title: "Фонетика языка. Произношение",
          text: "Обладать обширным словарным запасом ещё не означает владеть языком. Слова — это только инструмент, посредством которого выражаются мысли и чувства. Помимо того, что слова нужно знать, необходимо также уметь правильно их произносить. Точно так же, как вы привыкли воспринимать родную речь, иностранцы привыкли воспринимать свою. К тому же всегда похвально, когда человек говорит на другом языке правильно. Если же ещё и акцента нет, то это — высший пилотаж. В третьем уроке будут разобраны основы произношения иностранных слов: мы расскажем о том, как научиться правильно говорить на новом языке, представим несколько полезных ресурсов и программ, с которыми можно работать, тренируя произношение, дадим несколько советов от профессионалов и познакомим вас с эффективной системой работы над произношением. Отдельное внимание будет уделено транскрипциям и принципам транскрибирования. ",
          img: require("../assets/card-photo-33.jpg"),
        },
        {
          title: "Навыки письма и чтения",
          text: "В дополнение к словарному запасу и умению говорить каждый человек, желающий на высоком уровне овладеть иностранным языком, просто обязан уметь читать и писать. Это важно ещё и потому, что может пригодиться в путешествии и обычной туристической поездке, а также крайне необходимо, если вы собираетесь жить или работать за границей. Основной акцент в четвёртом уроке будет поставлен на вопросы письма и чтения. Из урока вы узнаете о том, что следует делать, чтобы научиться писать на иностранном языке, и подробно познакомитесь с информацией на тему того, почему важно уметь на нём читать. Мы расскажем о важности знания алфавита, о том, как легко и быстро выучить алфавит любого языка и познакомим вас с действенными техниками для запоминания написания иностранных слов. В конце урока будет дано несколько текстов на нескольких языках для самостоятельного чтения. ",
          img: require("../assets/card-photo-44.jpg"),
        },
        {
          title: "Грамматика иностранных языков",
          text: "Грамматика — это одна из самых сложных тем. От того, насколько хорошо человек знает грамматику иностранного языка, зависит то, как он говорит и пишет, как строит предложения, употребляет времена и части речи, где ставит знаки препинания и вообще, способен ли он действительно грамотно изъясняться словесно и письменно. Грамматика является гарантом грамотности в любом языке. В заключительном уроке мы будем говорить только о грамматике. Но учитывая объём данной темы вообще, мы раскроем лишь основные вопросы, чтобы указать вам правильное направление для дальнейшего развития. В первой части урока мы расскажем об основах грамматики при работе со словами, во второй — при работе с предложениями, в третьей — при работе с абзацами и текстами. В дополнительной части представим общие рекомендации по освоению грамматики, а также дадим ссылки на полезные ресурсы по изучению грамматики иностранных языков. ",
          img: require("../assets/card-photo-55.jpg"),
        },
      ],
    };
  },
};
</script>

<style lang="less" scoped>
@import url("../assets/mainStyle.less");
p {
  font-family: @dop-font;
  display: inline-block;
  padding: 0;
  margin: 0;
}
.text {
  color: @dop-color;
  font-size: 16px;
  letter-spacing: 0.5px;
}
</style>
